const Map<String, String> ruRU = {
  // общее
  'text.flags': 'Отмеченные',
  'text.cards': 'Карты',
  'text.flagged': 'отмечено',

  // главная страница
  'home.info': 'Всего созданных наборов карт',
  'button.image': 'Фото заметки',
  'desc.image': 'Сделай фото или загрузи и преврати в карточки',
  'button.paste': 'Вставить текст',
  'desc.paste': 'Преобразуй текст\nв карточки',
  'button.card': 'Мои наборы карт',
  'desc.card': 'Просмотреть все коллекции',
  'home.sub': 'Недавние наборы карт',
  'home.empty': 'Нет недавних карточек',

  // фото заметки
  'photo.title': 'Фото заметки',
  'photo.head': 'Выберите источник изображения',
  'photo.desc':
      'Сделайте фото или выберите изображение из галереи, чтобы создать новую карточку.',
  'button.picture': 'Сделать фото',
  'desc.picture': 'Используйте камеру, чтобы сфотографировать заметку',
  'button.gallery': 'Выбрать из галереи',
  'desc.gallery': 'Загрузите изображение заметки из памяти устройства',
  'notice.title': 'Советы для лучших результатов:',
  'notice.content1': 'Убедитесь, что изображение не размыто',
  'notice.content2': 'Используйте хорошее освещение',
  'notice.content3': 'Избегайте теней на тексте или объектах',
  'photo.loading': 'Создание карточек...',

  // вставить текст
  'paste.title': 'Вставить текст',
  'paste.head': 'Вставьте свои заметки',
  'paste.desc':
      'Вставьте учебные материалы или заметки, чтобы преобразовать их в карточки.',
  'notice.validation': 'Минимум 100 символов',
  'button.generate': 'Создать карточки',
  'paste.loading': 'Создание карточек...',

  // детали карточек
  'detail.title': 'Подробности набора карт',
  'detail.sub': 'Оригинальные заметки',
  'button.study': 'Начать изучение',

  // диалог
  'dialog.title': 'Удалить этот набор карт?',
  'dialog.sub': 'Вы не сможете восстановить его после удаления.',
  'dialog.confirm': 'Удалить',

  // список карточек
  'flashcard.title': 'Пакеты',
  'flashcard.search': 'Поиск карточек',
  'flashcard.emptySub': 'Карточки не найдены',
  'flashcard.emptyDesc':
      'Ваш набор карточек пуст. Начните создавать свои первые карточки ниже.',
  'button.create': 'Создать карточки',

  // страница обучения
  'notice1.title': 'Как использовать:',
  'notice1.content1': 'Нажмите на карточку, чтобы увидеть ответ',
  'notice1.content2': 'Смахните влево',
  'notice1.content3': 'Отметьте карточку, чтобы повторить позже',
  'button.finish': 'Готово',
  'button.cancel': 'Отмена',  
  'button.shuffle': 'Перемешать',

  // диалог обучения
  'dialog1.title': 'Вы действительно хотите завершить это занятие?',

  // настройки
  'settings.title': 'Настройки',
  'button.theme': 'Тема',
  'button.donation': 'Купи мне кофе',
};
